packerlschupfer/ESP32-Logger/src/Logger.cpp
/*
 * Logger.cpp - part of the ESP32-Logger library
 *
 * Copyright (C) 2025-2026 packerlschupfer
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the GNU General Public License as published by the Free
 * Software Foundation, either version 3 of the License, or (at your option)
 * any later version.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License for
 * more details.
 *
 * You should have received a copy of the GNU General Public License along
 * with this program.  If not, see <https://www.gnu.org/licenses/>.
 *
 * SPDX-License-Identifier: GPL-3.0-or-later
 */

// Logger.cpp
// Professional Logger implementation with tag-level filtering and memory optimization

#include "Logger.h"
#include "ConsoleBackend.h"
#include "SynchronizedConsoleBackend.h"
#include "NonBlockingConsoleBackend.h"
#include <cstring>
#include <algorithm>
#include <esp_log.h>
#include <soc/soc.h>  // For SOC_DRAM_LOW, SOC_DRAM_HIGH
#include <esp_system.h>  // esp_reset_reason

// Helper to check if pointer is in readable memory (DRAM or flash-mapped)
// Supports ESP32, ESP32-S2, ESP32-S3, ESP32-C3, ESP32-C6
static inline bool isPointerReadable(const void* ptr) {
    if (!ptr) return false;
    uintptr_t addr = (uintptr_t)ptr;

#if CONFIG_IDF_TARGET_ESP32
    // ESP32 DRAM: 0x3FFB0000 - 0x3FFFFFFF
    // ESP32 Flash-mapped: 0x3F400000 - 0x3F7FFFFF
    // ESP32 ROM: 0x3FF00000 - 0x3FF7FFFF
    return (addr >= 0x3F400000 && addr < 0x40000000);

#elif CONFIG_IDF_TARGET_ESP32S2
    // ESP32-S2 DRAM: 0x3FFB0000 - 0x3FFFFFFF
    // ESP32-S2 Flash-mapped: 0x3F000000 - 0x3FFFFFFF
    return (addr >= 0x3F000000 && addr < 0x40000000);

#elif CONFIG_IDF_TARGET_ESP32S3
    // ESP32-S3 DRAM: 0x3FC88000 - 0x3FCFFFFF
    // ESP32-S3 Flash-mapped: 0x3C000000 - 0x3DFFFFFF
    return (addr >= 0x3C000000 && addr < 0x3D000000) ||
           (addr >= 0x3FC00000 && addr < 0x3FD00000);

#elif CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32C6
    // ESP32-C3/C6 DRAM: 0x3FC80000 - 0x3FCFFFFF
    // ESP32-C3/C6 Flash-mapped: 0x3C000000 - 0x3C7FFFFF
    return (addr >= 0x3C000000 && addr < 0x3C800000) ||
           (addr >= 0x3FC80000 && addr < 0x3FD00000);

#else
    // Fallback: assume readable if not null (less safe, but functional)
    // This covers unknown/future ESP32 variants
    (void)addr;  // Suppress unused warning
    return true;
#endif
}

// ESP-IDF log redirection function
static int esp_log_redirect(const char* format, va_list args) {
    // Validate format pointer - ESP-IDF internal components may pass invalid pointers
    // (e.g., from IRAM/ROM) that cause LoadProhibited exceptions when accessed
    if (!format || !isPointerReadable(format)) {
        return 0;
    }

    // Get the logger instance
    Logger& logger = Logger::getInstance();

    // Use buffer pool instead of thread-local to reduce per-thread overhead
    // Small fixed buffer for tag extraction (on stack, only 33 bytes)
    char tag_buffer[CONFIG_LOG_SUBSCRIBER_TAG_SIZE + 1];

    // Extract tag and format from ESP-IDF log format
    // ESP-IDF format is typically: "TAG: message" or just "message"
    const char* tag = "ESP";
    const char* msg_start = format;

    // Look for colon to extract tag
    const char* colon = strchr(format, ':');
    if (colon && (colon - format) < CONFIG_LOG_SUBSCRIBER_TAG_SIZE) {
        // Extract tag
        size_t tag_len = colon - format;
        memcpy(tag_buffer, format, tag_len);
        tag_buffer[tag_len] = '\0';
        tag = tag_buffer;
        msg_start = colon + 1;
        while (*msg_start == ' ') msg_start++;  // Skip spaces after colon
    }

    // Use logger to output the message
    logger.logV(ESP_LOG_INFO, tag, msg_start, args);

    return 0;  // Return value is ignored by ESP-IDF
}

// BufferPool implementation
BufferPool::BufferPool() : poolMutex(nullptr) {
    // Only create mutex if FreeRTOS scheduler is running
    // This prevents issues if Logger is used before scheduler starts
    if (xTaskGetSchedulerState() != taskSCHEDULER_NOT_STARTED) {
        poolMutex = xSemaphoreCreateMutex();
    }
    // Pool array is zero-initialized by default
}

char* BufferPool::acquire() {
    if (!poolMutex) {
        return (char*)malloc(BUFFER_SIZE);
    }

    // Always use mutex to prevent race conditions
    if (xSemaphoreTake(poolMutex, pdMS_TO_TICKS(LoggerConfig::MUTEX_STANDARD_TIMEOUT_MS)) == pdTRUE) {
        for (auto& buffer : pool) {
            bool expected = false;
            if (buffer.inUse.compare_exchange_strong(expected, true)) {
                xSemaphoreGive(poolMutex);
                return buffer.data;
            }
        }
        xSemaphoreGive(poolMutex);
    }

    // No buffer available - fallback to heap allocation
    return (char*)malloc(BUFFER_SIZE);
}

void BufferPool::release(char* buffer) {
    if (!buffer) return;

    // Check if it's from our pool
    for (auto& poolBuffer : pool) {
        if (buffer == poolBuffer.data) {
            poolBuffer.inUse.store(false);
            return;
        }
    }

    // Not from pool - must be heap allocated
    free(buffer);
}

// Helper to safely create mutex (returns nullptr if scheduler not running)
static SemaphoreHandle_t createMutexSafe() {
    if (xTaskGetSchedulerState() != taskSCHEDULER_NOT_STARTED) {
        return xSemaphoreCreateMutex();
    }
    return nullptr;
}

// Logger implementation
Logger::Logger()
    : backendMutex(createMutexSafe()),
      subscriberMutex(createMutexSafe()),
      tagMutex(createMutexSafe()),
      rateLimitMutex(createMutexSafe()),
      lastLogTime(0),
      logCounter(0) {
#ifdef LOG_DEFERRED_FORMAT
    DeferredLog::init();
    drainMutex_ = createMutexSafe();
#endif
    // Add default non-blocking console backend to prevent freezes
    backends.push_back(std::make_shared<NonBlockingConsoleBackend>());

