packerlschupfer/ESP32-Logger/src/Logger.cpp
void Logger::logInL(const char* format, ...) {
    if (!isLoggingEnabled.load()) return;
    if (!checkRateLimit()) return;

    va_list args;
    va_start(args, format);

#ifdef LOG_DEFERRED_FORMAT
    enqueueDeferred(ESP_LOG_INFO, "INL", DeferredLog::FLAG_NO_HEADER, format, args);
    va_end(args);
#else
    auto& pool = BufferPool::getInstance();

    char* formatBuffer = pool.acquire();
    if (!formatBuffer) {
        va_end(args);
        return;
    }

    vsnprintf(formatBuffer, CONFIG_LOG_BUFFER_SIZE, format, args);
    va_end(args);

    // Notify subscribers (using INFO level and "INL" tag for inline logs)
    notifySubscribers(ESP_LOG_INFO, "INL", formatBuffer);

    writeToBackends(formatBuffer, strlen(formatBuffer));
    pool.release(formatBuffer);
#endif
}

void Logger::logDirect(esp_log_level_t level, const char* tag, const char* message) {
    if (!message) return;  // Prevent nullptr dereference
    if (!isLevelEnabledForTag(tag, level)) return;
    // Note: logDirect intentionally bypasses rate limiting but still notifies subscribers

#ifdef LOG_DEFERRED_FORMAT
    enqueueDeferredf(level, tag, 0, "%s", message);
#else
    // Notify subscribers with the raw message
    notifySubscribers(level, tag, message);

    auto& pool = BufferPool::getInstance();

    char* fullMessage = pool.acquire();
    if (fullMessage) {
        int len = snprintf(fullMessage, CONFIG_LOG_BUFFER_SIZE,
                          "[%lu][%s][%s] %s: %s\r\n",
                          millis(),
                          pcTaskGetName(NULL) ?: "?",
                          levelToString(level),
                          tag ?: "?",
                          message);

        writeToBackends(fullMessage, len);
        pool.release(fullMessage);
    } else {
        esp_log_write(level, tag, "%s", message);
    }
#endif
}

void Logger::flush() {
#ifdef LOG_DEFERRED_FORMAT
    // Get queued messages out before flushing the backends
    TaskHandle_t logTask = subscriberTaskHandle;
    if (!logTask) {
        drainDeferred();
    } else if (xTaskGetCurrentTaskHandle() != logTask) {
        for (int i = 0; i < 50 && !DeferredLog::empty(); i++) {
            xTaskNotifyGive(logTask);
            vTaskDelay(pdMS_TO_TICKS(10));
        }
    }
#endif

    // Flush directly without mutex if scheduler not started (single-threaded)
    if (!backendMutex) {
        for (auto& backend : backends) {
            if (backend) {
                backend->flush();
            }
        }
        return;
    }

    if (xSemaphoreTake(backendMutex, pdMS_TO_TICKS(LoggerConfig::MUTEX_SHORT_TIMEOUT_MS)) == pdTRUE) {
        for (auto& backend : backends) {
            if (backend) {
                backend->flush();
            }
        }
        xSemaphoreGive(backendMutex);
    }
}

void Logger::resetDroppedLogs() {
    droppedLogs.store(0);
}

void Logger::enableESPLogRedirection() {
    // Redirect ESP-IDF logs through our logger
    esp_log_set_vprintf(&esp_log_redirect);
}

// Log subscriber implementation
bool Logger::addLogSubscriber(LogSubscriberCallback callback) {
    if (callback == nullptr) {
        return false;
    }

    // Thread safety - only if mutex available
    if (subscriberMutex && xSemaphoreTake(subscriberMutex, pdMS_TO_TICKS(LoggerConfig::MUTEX_SHORT_TIMEOUT_MS)) != pdTRUE) {
        return false;
    }

    bool result = false;
    uint8_t count = subscriberCount.load();

    // Check for duplicates and available slots
    if (count < MAX_SUBSCRIBERS) {
        bool isDuplicate = false;
        for (uint8_t i = 0; i < count; i++) {
            if (subscribers[i] == callback) {
                isDuplicate = true;
                break;
            }
        }

        if (!isDuplicate) {
            subscribers[count] = callback;
            subscriberCount.store(count + 1);
            result = true;
        }
    }

    if (subscriberMutex) {
        xSemaphoreGive(subscriberMutex);
    }

    return result;
}

bool Logger::removeLogSubscriber(LogSubscriberCallback callback) {
    if (callback == nullptr) {
        return false;
    }

    if (subscriberMutex && xSemaphoreTake(subscriberMutex, pdMS_TO_TICKS(LoggerConfig::MUTEX_SHORT_TIMEOUT_MS)) != pdTRUE) {
        return false;
    }

    bool result = false;
    uint8_t count = subscriberCount.load();

    for (uint8_t i = 0; i < count; i++) {
        if (subscribers[i] == callback) {
            // Shift remaining subscribers down
            for (uint8_t j = i; j < count - 1; j++) {
                subscribers[j] = subscribers[j + 1];
            }
            count--;
            subscribers[count] = nullptr;
            subscriberCount.store(count);
            result = true;
            break;
        }
    }

    if (subscriberMutex) {
        xSemaphoreGive(subscriberMutex);
    }

    return result;
}

bool Logger::startSubscriberTask(int coreId) {
    // Already running?
    if (subscriberTaskHandle != nullptr) {
        return true;
    }

#ifdef LOG_DEFERRED_FORMAT
    // The logger task formats, writes backends and calls subscribers; no queue needed
    TaskFunction_t taskFunc = logTaskFunc;
    const char* taskName = "Logger";
#else
    // Create queue if not exists
    if (subscriberQueue == nullptr) {
        subscriberQueue = xQueueCreate(CONFIG_LOG_SUBSCRIBER_QUEUE_SIZE, sizeof(LogSubscriberMessage));
        if (subscriberQueue == nullptr) {
            return false;
        }
    }
    TaskFunction_t taskFunc = subscriberTaskFunc;
    const char* taskName = "LogSub";
#endif

    subscriberTaskRunning.store(true);

    // Create task with optional core affinity
    BaseType_t result;
    if (coreId >= 0 && coreId <= 1) {
        result = xTaskCreatePinnedToCore(
            taskFunc,
            taskName,
            CONFIG_LOG_SUBSCRIBER_TASK_STACK,
            this,
            CONFIG_LOG_SUBSCRIBER_TASK_PRIORITY,
            &subscriberTaskHandle,
            coreId
        );
    } else {
        result = xTaskCreate(
            taskFunc,
            taskName,
            CONFIG_LOG_SUBSCRIBER_TASK_STACK,
            this,
            CONFIG_LOG_SUBSCRIBER_TASK_PRIORITY,
            &subscriberTaskHandle
        );
    }

    if (result != pdPASS) {
        subscriberTaskRunning.store(false);
        subscriberTaskHandle = nullptr;
        return false;
    }

