packerlschupfer/ESP32-Logger/src/Logger.cpp
    return true;
}

void Logger::stopSubscriberTask() {
    if (subscriberTaskHandle == nullptr) {
        return;
    }

    // Signal task to stop
    subscriberTaskRunning.store(false);

#ifdef LOG_DEFERRED_FORMAT
    xTaskNotifyGive(subscriberTaskHandle);
#endif

    // Send a dummy message to wake up the task if it's blocked on queue
    if (subscriberQueue) {
        LogSubscriberMessage dummy = {};
        xQueueSend(subscriberQueue, &dummy, 0);
    }

    // Wait for task to finish (with timeout)
    for (int i = 0; i < 50 && subscriberTaskHandle != nullptr; i++) {
        vTaskDelay(pdMS_TO_TICKS(10));
    }

    // Force delete if still running
    if (subscriberTaskHandle != nullptr) {
        vTaskDelete(subscriberTaskHandle);
        subscriberTaskHandle = nullptr;
    }

    // Clean up queue
    if (subscriberQueue) {
        vQueueDelete(subscriberQueue);
        subscriberQueue = nullptr;
    }
}

void Logger::subscriberTaskFunc(void* param) {
    Logger* logger = static_cast<Logger*>(param);
    LogSubscriberMessage msg;

    while (logger->subscriberTaskRunning.load()) {
        // Wait for message (with timeout to check running flag)
        if (xQueueReceive(logger->subscriberQueue, &msg, pdMS_TO_TICKS(100)) == pdTRUE) {
            // Check if we should stop
            if (!logger->subscriberTaskRunning.load()) {
                break;
            }

            logger->invokeSubscribers(msg.level, msg.tag, msg.message);
        }
    }

    // Clean exit
    logger->subscriberTaskHandle = nullptr;
    vTaskDelete(nullptr);
}

void Logger::notifySubscribers(esp_log_level_t level, const char* tag, const char* message) {
    // Fast path - no subscribers registered (atomic load is cheap)
    if (subscriberCount.load() == 0) {
        return;
    }

    // Safety check - don't queue from ISR context
    if (xPortInIsrContext()) {
        return;
    }

    // If queue exists, use async notification (preferred)
    if (subscriberQueue) {
        LogSubscriberMessage msg;
        msg.level = level;

        // Safe string copy with null termination
        if (tag) {
            strncpy(msg.tag, tag, CONFIG_LOG_SUBSCRIBER_TAG_SIZE - 1);
            msg.tag[CONFIG_LOG_SUBSCRIBER_TAG_SIZE - 1] = '\0';
        } else {
            msg.tag[0] = '\0';
        }

        if (message) {
            strncpy(msg.message, message, CONFIG_LOG_SUBSCRIBER_MSG_SIZE - 1);
            msg.message[CONFIG_LOG_SUBSCRIBER_MSG_SIZE - 1] = '\0';
        } else {
            msg.message[0] = '\0';
        }

        // Non-blocking send - drop message if queue is full
        xQueueSend(subscriberQueue, &msg, 0);
        return;
    }

    // Fallback: synchronous notification (legacy behavior, not recommended)
    // Only used if startSubscriberTask() was never called
    invokeSubscribers(level, tag, message);
}

void Logger::invokeSubscribers(esp_log_level_t level, const char* tag, const char* message) {
    if (subscriberCount.load() == 0) {
        return;
    }

    // Copy callbacks while holding mutex to avoid calling with mutex held
    LogSubscriberCallback localCallbacks[MAX_SUBSCRIBERS];
    uint8_t localCount = 0;

    if (subscriberMutex && xSemaphoreTake(subscriberMutex, pdMS_TO_TICKS(LoggerConfig::MUTEX_SHORT_TIMEOUT_MS)) == pdTRUE) {
        localCount = subscriberCount.load();
        for (uint8_t i = 0; i < localCount; i++) {
            localCallbacks[i] = subscribers[i];
        }
        xSemaphoreGive(subscriberMutex);
    } else {
        return;  // Can't get mutex - skip notification
    }

    // Invoke callbacks WITHOUT holding mutex (prevents deadlock on reentrant logging)
    for (uint8_t i = 0; i < localCount; i++) {
        if (localCallbacks[i] != nullptr) {
            localCallbacks[i](level, tag, message);
        }
    }
}

#ifdef LOG_DEFERRED_FORMAT
// ---------------------------------------------------------------------------
// Deferred formatting (LOG_DEFERRED_FORMAT)
//
// Callers only capture arguments into DeferredLog's ring. Everything with a
// large stack frame - newlib's formatter, backend writes, subscriber callbacks
// such as Syslog - runs on the logger task (or in drainDeferred()).
// ---------------------------------------------------------------------------

namespace {

// How long an entry may stay half-written before the logger task gives up on
// its producer (e.g. a task deleted mid-log). Must be far above any normal
// preemption delay: a producer that resumes after the skip would write into
// ring space that has been handed to another entry.
constexpr uint32_t DEFERRED_BUSY_SKIP_MS = 1000;

// Messages the logger emits about itself
constexpr const char* DEFERRED_TAG = "Logger";

const char* resetReasonName(esp_reset_reason_t reason) {
    switch (reason) {
        case ESP_RST_POWERON:   return "POWERON";
        case ESP_RST_EXT:       return "EXT";
        case ESP_RST_SW:        return "SW";
        case ESP_RST_PANIC:     return "PANIC";
        case ESP_RST_INT_WDT:   return "INT_WDT";
        case ESP_RST_TASK_WDT:  return "TASK_WDT";
        case ESP_RST_WDT:       return "WDT";
        case ESP_RST_DEEPSLEEP: return "DEEPSLEEP";
        case ESP_RST_BROWNOUT:  return "BROWNOUT";
        case ESP_RST_SDIO:      return "SDIO";
        default:                return "UNKNOWN";
    }
}

bool isAbnormalReset(esp_reset_reason_t reason) {
    return reason == ESP_RST_PANIC || reason == ESP_RST_INT_WDT || reason == ESP_RST_TASK_WDT ||
           reason == ESP_RST_WDT || reason == ESP_RST_BROWNOUT;
}

const char* currentTaskName() {
    if (xTaskGetSchedulerState() == taskSCHEDULER_NOT_STARTED) return "boot";
    const char* name = pcTaskGetName(nullptr);
    return name ? name : "?";
}

} // namespace

void Logger::enqueueDeferred(esp_log_level_t level, const char* tag, uint8_t flags,
                             const char* format, va_list args) {
    if (!DeferredLog::push(level, tag, format, args, flags)) {
        droppedLogs.fetch_add(1);
        return;
    }
    TaskHandle_t logTask = subscriberTaskHandle;
    if (logTask) {
        xTaskNotifyGive(logTask);
    }
}

