packerlschupfer/ESP32-Logger/src/Logger.cpp
void Logger::enqueueDeferredf(esp_log_level_t level, const char* tag, uint8_t flags,
                              const char* format, ...) {
    va_list args;
    va_start(args, format);
    enqueueDeferred(level, tag, flags, format, args);
    va_end(args);
}

DeferredLog::PopResult Logger::processDeferred(bool skipBusy) {
    DeferredLog::Record record;
    const DeferredLog::PopResult result =
        DeferredLog::pop(record, deferredMessage_, sizeof(deferredMessage_), skipBusy);
    if (result == DeferredLog::PopResult::OK) {
        deliverDeferred(record, deferredMessage_);
    }
    return result;
}

void Logger::deliverDeferred(const DeferredLog::Record& record, const char* message) {
    // Pre-reset entries go to the backends only: subscribers (e.g. Syslog) would
    // stamp them with the current time, and they are rarely connected this early.
    if (!record.preReset) {
        invokeSubscribers(record.level, record.tag, message);
    }

    if (record.flags & DeferredLog::FLAG_NO_HEADER) {
        writeToBackends(message, strlen(message));
        return;
    }

    const bool newline = !(record.flags & DeferredLog::FLAG_NO_NEWLINE);
    int len = snprintf(deferredLine_, sizeof(deferredLine_),
                       "%s[%lu][%s][%s] %s: %s%s",
                       record.preReset ? "[pre-reset]" : "",
                       static_cast<unsigned long>(record.timestamp),
                       record.task[0] ? record.task : "?",
                       levelToString(record.level),
                       record.tag[0] ? record.tag : "?",
                       message,
                       newline ? "\r\n" : "");
    if (len < 0) return;

    // Ensure message wasn't truncated (keep the line ending if there is one)
    if (len >= static_cast<int>(sizeof(deferredLine_))) {
        len = sizeof(deferredLine_) - 1;
        if (newline) {
            deferredLine_[len - 2] = '\r';
            deferredLine_[len - 1] = '\n';
        }
        deferredLine_[len] = '\0';
    }

    writeToBackends(deferredLine_, len);
}

void Logger::reportResetRecovery() {
    if (resetReported_) return;
    resetReported_ = true;

    const esp_reset_reason_t reason = esp_reset_reason();
    const uint32_t recovered = DeferredLog::recoveredCount();
    const uint32_t incomplete = DeferredLog::recoveredIncompleteCount();

    DeferredLog::Record record = {};
    record.level = (isAbnormalReset(reason) || recovered > 0) ? ESP_LOG_WARN : ESP_LOG_INFO;
    record.timestamp = millis();
    strncpy(record.tag, DEFERRED_TAG, sizeof(record.tag) - 1);
    strncpy(record.task, currentTaskName(), sizeof(record.task) - 1);

    // Always reported: an empty ring after an unexplained restart is evidence too
    // (RTC memory is lost on power-on and brownout, kept on panic/WDT/software reset)
    if (DeferredLog::ringSurvivedReset()) {
        snprintf(deferredMessage_, sizeof(deferredMessage_),
                 "Reset reason %s: %lu log entries recovered from before the reset%s",
                 resetReasonName(reason),
                 static_cast<unsigned long>(recovered),
                 incomplete ? " (plus incomplete ones, skipped)" : "");
    } else {
        snprintf(deferredMessage_, sizeof(deferredMessage_),
                 "Reset reason %s: no log entries recovered (ring not retained: power loss, "
                 "brownout, or new firmware)",
                 resetReasonName(reason));
    }
    deliverDeferred(record, deferredMessage_);
}

void Logger::reportDeferredOverflow() {
    const uint32_t overflows = DeferredLog::overflowCount();
    if (overflows == reportedOverflows_) return;

    DeferredLog::Record record = {};
    record.level = ESP_LOG_WARN;
    record.timestamp = millis();
    strncpy(record.tag, DEFERRED_TAG, sizeof(record.tag) - 1);
    strncpy(record.task, currentTaskName(), sizeof(record.task) - 1);
    snprintf(deferredMessage_, sizeof(deferredMessage_),
             "%lu log entries dropped (deferred ring full or entry too large)",
             static_cast<unsigned long>(overflows - reportedOverflows_));
    reportedOverflows_ = overflows;
    deliverDeferred(record, deferredMessage_);
}

void Logger::drainDeferred() {
    if (drainMutex_ && xSemaphoreTake(drainMutex_, pdMS_TO_TICKS(LoggerConfig::MUTEX_STANDARD_TIMEOUT_MS)) != pdTRUE) {
        mutexTimeouts_.fetch_add(1);
        return;
    }

    reportResetRecovery();
    // Never skip busy entries here: their producers are alive on other tasks
    while (processDeferred(false) == DeferredLog::PopResult::OK) {
    }
    reportDeferredOverflow();

    if (drainMutex_) xSemaphoreGive(drainMutex_);
}

void Logger::logTaskFunc(void* param) {
    Logger* logger = static_cast<Logger*>(param);
    TickType_t busySince = 0;
    bool skipBusy = false;

    logger->drainDeferred();  // reset report + anything queued before the task started

    while (logger->subscriberTaskRunning.load()) {
        DeferredLog::PopResult result = DeferredLog::PopResult::EMPTY;
        if (!logger->drainMutex_ ||
            xSemaphoreTake(logger->drainMutex_, pdMS_TO_TICKS(LoggerConfig::MUTEX_STANDARD_TIMEOUT_MS)) == pdTRUE) {
            result = logger->processDeferred(skipBusy);
            if (result == DeferredLog::PopResult::EMPTY) {
                logger->reportDeferredOverflow();
            }
            if (logger->drainMutex_) xSemaphoreGive(logger->drainMutex_);
        }

        if (result == DeferredLog::PopResult::OK) {
            busySince = 0;
            skipBusy = false;
            continue;
        }

        if (result == DeferredLog::PopResult::BUSY) {
            // A producer is mid-write; give it time to finish
            const TickType_t now = xTaskGetTickCount();
            if (busySince == 0) {
                busySince = now ? now : 1;
            } else if (now - busySince > pdMS_TO_TICKS(DEFERRED_BUSY_SKIP_MS)) {
                skipBusy = true;
            }
            vTaskDelay(1);
            continue;
        }

        busySince = 0;
        skipBusy = false;
        ulTaskNotifyTake(pdTRUE, pdMS_TO_TICKS(100));
    }

    // Clean exit
    logger->subscriberTaskHandle = nullptr;
    vTaskDelete(nullptr);
}
#endif // LOG_DEFERRED_FORMAT

// Global logger getter
Logger& getLogger() {
    return Logger::getInstance();
}